/*
================================================================================
					 オブジェクト指向＆＆ゲームプログラミング
	     Copyright (c) 2011 Human Academy Sendai. All rights reserved.
================================================================================

 【対象ＯＳ】
     Microsoft Windows 7以降

 【コンパイラ】
     Microsoft VisualC++ 2013

 【プログラム】
	 Script.hpp
				Scriptクラスヘッダーファイル

 【バージョン】
	 * Version    2015.10.00      2015/08/28  03:10:03

================================================================================
*/

#pragma once

//------------------------------------------------------------------------------
//	インクルードファイル
//------------------------------------------------------------------------------
#include "Script.hpp"

//------------------------------------------------------------------------------
//	実行
//------------------------------------------------------------------------------
void CScript::Run()
{ 
	SquirrelVM::RunScript(m_SqObject);
}

//------------------------------------------------------------------------------
//	スクリプトオブジェクト取得
//------------------------------------------------------------------------------
SquirrelObject CScript::GetScriptObject(const SQChar* inName)
{
	SquirrelObject   root = SquirrelVM::GetRootTable();
	return root.GetValue(inName);
}

//------------------------------------------------------------------------------
//	バインド
//------------------------------------------------------------------------------
void CScript::Bind(const SQChar* inName, int& inVariable)
{
	SqPlus::BindVariable(&inVariable, inName);
}

//------------------------------------------------------------------------------
//	バインド
//------------------------------------------------------------------------------
void CScript::Bind(const SQChar* inName, float& inVariable)
{
	SqPlus::BindVariable(&inVariable, inName);
}

//------------------------------------------------------------------------------
//	バインド
//------------------------------------------------------------------------------
void CScript::Bind(const SQChar* inName, bool& inVariable)
{
	SqPlus::BindVariable(&inVariable, inName);
}

//------------------------------------------------------------------------------
//	配列生成
//------------------------------------------------------------------------------
void CScript::CreateArray(const SQChar* inName, const UINT inSize)
{
	SquirrelObject   arr  = SquirrelVM::CreateArray(inSize);
	SquirrelObject   root = SquirrelVM::GetRootTable();
	root.SetValue(inName, arr);
}
