/*
================================================================================
					 オブジェクト指向＆＆ゲームプログラミング
	     Copyright (c) 2011 Human Academy Sendai. All rights reserved.
================================================================================

 【対象ＯＳ】
     Microsoft Windows 7以降

 【コンパイラ】
     Microsoft VisualC++ 2013

 【プログラム】
	 ComLibrary.cpp
				COMライブラリクラスヘッダーファイル

 【バージョン】
	 * Version    2015.10.00      2015/08/28  03:10:03

================================================================================
*/

//------------------------------------------------------------------------------
//	インクルードファイル
//------------------------------------------------------------------------------
#include "ComLibrary.hpp"

//------------------------------------------------------------------------------
//	クラス変数
//------------------------------------------------------------------------------
int CComLibrary::m_Ref = 0;

//------------------------------------------------------------------------------
//	COMライブラリ初期化
//------------------------------------------------------------------------------
bool CComLibrary::Initialize()
{
	m_Ref++;
	if(m_Ref == 1) {
		if(::CoInitializeEx(NULL, COINIT_APARTMENTTHREADED | COINIT_DISABLE_OLE1DDE)
		   != S_OK) {
			::OutputDebugString(TEXT("*** Error - COM初期化失敗(CComLibrary_Initialize)\n"));
			m_Ref = 0;
			return false;
		}
	}

	return true;
}

//------------------------------------------------------------------------------
//	COMライブラリ解放
//------------------------------------------------------------------------------
void CComLibrary::Uninitialize()
{
	if(m_Ref <= 0)
		return;

	m_Ref--;
	if(m_Ref == 0)
		::CoUninitialize();
}
