/*
================================================================================
					 オブジェクト指向＆＆ゲームプログラミング
	     Copyright (c) 2011 Human Academy Sendai. All rights reserved.
================================================================================

 【対象ＯＳ】
     Microsoft WindowsXP以降

 【コンパイラ】
     Microsoft VisualC++ 2008

 【プログラム】
	 SoundVoice.hpp
				サウンドボイスクラスヘッダーファイル

 【バージョン】
	 * Version    2014.03.00      2014/03/14  03:10:03

================================================================================
*/

#pragma once

//------------------------------------------------------------------------------
//	インクルードファイル
//------------------------------------------------------------------------------
#include <XAudio2.h>

//------------------------------------------------------------------------------
//	サウンドボイスインタフェース定義
//------------------------------------------------------------------------------
class ISoundVoice {
public:
	virtual ~ISoundVoice() {}
};

//------------------------------------------------------------------------------
//	サウンドボイスクラス定義
//------------------------------------------------------------------------------
class CSoundVoice : public ISoundVoice {
public:
	CSoundVoice(IXAudio2SourceVoice* pXASrcVoice) {}
	virtual ~CSoundVoice() { m_pXASrcVoice->DestroyVoice(); }

private:
	IXAudio2SourceVoice*   m_pXASrcVoice;
};

//------------------------------------------------------------------------------
//	NULLサウンドボイスクラス定義
//------------------------------------------------------------------------------
class CNullSoundVoice : public ISoundVoice {
public:
	CNullSoundVoice() {}
	virtual ~CNullSoundVoice() {}
};
