/*
================================================================================
					 オブジェクト指向＆＆ゲームプログラミング
	     Copyright (c) 2011 Human Academy Sendai. All rights reserved.
================================================================================

 【対象ＯＳ】
     Microsoft Windows 7以降

 【コンパイラ】
     Microsoft VisualC++ 2013

 【プログラム】
	 FixTimer.hpp
				固定タイマークラス

 【バージョン】
	 * Version    2015.10.00      2015/08/28  03:10:03

================================================================================
*/

//------------------------------------------------------------------------------
//	インクルードファイル
//------------------------------------------------------------------------------
#include "FixTimer.hpp"

//------------------------------------------------------------------------------
//	スタティックリンクライブラリ
//------------------------------------------------------------------------------
#pragma comment(lib, "winmm.lib")

//------------------------------------------------------------------------------
//	デフォルトコンストラクタ
//------------------------------------------------------------------------------
CFixTimer::CFixTimer() : m_FPS(0), m_PeriodMin(0), m_MaxWait(0), m_LastTime(0)
{
	// マルチメディアタイマ能力取得
	TIMECAPS   tc;
	::timeGetDevCaps(&tc, sizeof(tc));
	m_PeriodMin = tc.wPeriodMin;

	// マルチメディアタイマ分解能設定
	::timeBeginPeriod(m_PeriodMin);

	SetFPS(60);
	Reset();
}

//------------------------------------------------------------------------------
//	デストラクタ
//------------------------------------------------------------------------------
CFixTimer::~CFixTimer()
{
	if(m_PeriodMin != 0)
		::timeEndPeriod(m_PeriodMin);
}

//------------------------------------------------------------------------------
//	待機
//------------------------------------------------------------------------------
void CFixTimer::Wait()
{
	// フレームレート制御処理
	long   wait = m_MaxWait - (::timeGetTime() - m_LastTime);
	if(wait < 0)
		wait = 0;

	::Sleep((DWORD)wait);

	m_LastTime = ::timeGetTime();
}
